Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70J19.xml
          </instance>
        </module>
        <module name="MCAN" version="11273C">
          <instance name="MCAN0">
            <register-group address-space="base" name="MCAN0" name-in-module="MCAN" offset="0x40030000"/>
            <signals>
              <signal pad="PB3" function="A" group="CANRX" index="0"/>
              <signal pad="PB2" function="A" group="CANTX" index="0"/>
            </signals>
          </instance>
          <instance name="MCAN1">
            <register-group address-space="base" name="MCAN1" name-in-module="MCAN" offset="0x40034000"/>
            <signals>
              <signal pad="PC12" function="C" group="CANRX" index="1"/>
              <signal pad="PD28" function="B" group="CANRX" index="1"/>
              <signal pad="PC14" function="C" group="CANTX" index="1"/>
              <signal pad="PD12" function="B" group="CANTX" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="PIO" version="11004T">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
            <signals>
              <signal pad="PA21" function="X1" group="AFE0_AD" index="1"/>
              <signal pad="PA21" function="X1" group="PIODCEN" index="2"/>
              <signal pad="PA22" function="X1" group="PIODCCLK"/>
              <signal pad="PA3" function="X1" group="PIODC" index="0"/>
              <signal pad="PA10" function="X1" group="PIODC" index="4"/>
              <signal pad="PA12" function="X1" group="PIODC" index="6"/>
              <signal pad="PA13" function="X1" group="PIODC" index="7"/>
              <signal pad="PA4" function="X1" group="WKUP" index="3"/>
              <signal pad="PA4" function="X1" group="PIODC" index="1"/>
              <signal pad="PA5" function="X1" group="WKUP" index="4"/>
              <signal pad="PA5" function="X1" group="PIODC" index="2"/>
              <signal pad="PA9" function="X1" group="WKUP" index="6"/>
              <signal pad="PA9" function="X1" group="PIODC" index="3"/>
              <signal pad="PA11" function="X1" group="WKUP" index="7"/>
              <signal pad="PA11" function="X1" group="PIODC" index="5"/>
              <signal pad="PA14" function="X1" group="WKUP" index="8"/>
              <signal pad="PA14" function="X1" group="PIODCEN" index="1"/>
            </signals>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
          </instance>
          <instance name="PIOD">
            <register-group address-space="base" name="PIOD" name-in-module="PIO" offset="0x400E1400"/>
          </instance>
        </module>
        <module name="PMC" version="44006C">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0600"/>
            <signals>
              <signal pad="PA6" function="B" group="PCK" index="0"/>
              <signal pad="PB12" function="D" group="PCK" index="0"/>
              <signal pad="PB13" function="B" group="PCK" index="0"/>
              <signal pad="PA17" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="1"/>
              <signal pad="PA3" function="C" group="PCK" index="2"/>
              <signal pad="PA18" function="B" group="PCK" index="2"/>
              <signal pad="PA31" function="B" group="PCK" index="2"/>
              <signal pad="PB3" function="B" group="PCK" index="2"/>
              <signal pad="PD31" function="C" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" version="6343R">
          <instance name="PWM0">
            <register-group address-space="base" name="PWM0" name-in-module="PWM" offset="0x40020000"/>
            <signals>
              <signal pad="PA10" function="B" group="PWMC0_PWMEXTRG" index="0"/>
              <signal pad="PA22" function="B" group="PWMC0_PWMEXTRG" index="1"/>
              <signal pad="PA9" function="C" group="PWMC0_PWMFI" index="0"/>
              <signal pad="PD8" function="B" group="PWMC0_PWMFI" index="1"/>
              <signal pad="PD9" function="B" group="PWMC0_PWMFI" index="2"/>
              <signal pad="PA0" function="A" group="PWMC0_PWMH" index="0"/>
              <signal pad="PA11" function="B" group="PWMC0_PWMH" index="0"/>
              <signal pad="PA23" function="B" group="PWMC0_PWMH" index="0"/>
              <signal pad="PB0" function="A" group="PWMC0_PWMH" index="0"/>
              <signal pad="PD11" function="B" group="PWMC0_PWMH" index="0"/>
              <signal pad="PD20" function="A" group="PWMC0_PWMH" index="0"/>
              <signal pad="PA2" function="A" group="PWMC0_PWMH" index="1"/>
              <signal pad="PA12" function="B" group="PWMC0_PWMH" index="1"/>
              <signal pad="PA24" function="B" group="PWMC0_PWMH" index="1"/>
              <signal pad="PB1" function="A" group="PWMC0_PWMH" index="1"/>
              <signal pad="PD21" function="A" group="PWMC0_PWMH" index="1"/>
              <signal pad="PA13" function="B" group="PWMC0_PWMH" index="2"/>
              <signal pad="PA25" function="B" group="PWMC0_PWMH" index="2"/>
              <signal pad="PB4" function="B" group="PWMC0_PWMH" index="2"/>
              <signal pad="PC19" function="B" group="PWMC0_PWMH" index="2"/>
              <signal pad="PD22" function="A" group="PWMC0_PWMH" index="2"/>
              <signal pad="PA7" function="B" group="PWMC0_PWMH" index="3"/>
              <signal pad="PA14" function="B" group="PWMC0_PWMH" index="3"/>
              <signal pad="PA17" function="C" group="PWMC0_PWMH" index="3"/>
              <signal pad="PC13" function="B" group="PWMC0_PWMH" index="3"/>
              <signal pad="PC21" function="B" group="PWMC0_PWMH" index="3"/>
              <signal pad="PD23" function="A" group="PWMC0_PWMH" index="3"/>
              <signal pad="PA1" function="A" group="PWMC0_PWML" index="0"/>
              <signal pad="PA19" function="B" group="PWMC0_PWML" index="0"/>
              <signal pad="PB5" function="B" group="PWMC0_PWML" index="0"/>
              <signal pad="PC0" function="B" group="PWMC0_PWML" index="0"/>
              <signal pad="PD10" function="B" group="PWMC0_PWML" index="0"/>
              <signal pad="PD24" function="A" group="PWMC0_PWML" index="0"/>
              <signal pad="PA20" function="B" group="PWMC0_PWML" index="1"/>
              <signal pad="PB12" function="A" group="PWMC0_PWML" index="1"/>
              <signal pad="PC1" function="B" group="PWMC0_PWML" index="1"/>
              <signal pad="PC18" function="B" group="PWMC0_PWML" index="1"/>
              <signal pad="PD25" function="A" group="PWMC0_PWML" index="1"/>
              <signal pad="PA16" function="C" group="PWMC0_PWML" index="2"/>
              <signal pad="PA30" function="A" group="PWMC0_PWML" index="2"/>
              <signal pad="PB13" function="A" group="PWMC0_PWML" index="2"/>
              <signal pad="PC2" function="B" group="PWMC0_PWML" index="2"/>
              <signal pad="PC20" function="B" group="PWMC0_PWML" index="2"/>
              <signal pad="PD26" function="A" group="PWMC0_PWML" index="2"/>
              <signal pad="PA15" function="C" group="PWMC0_PWML" index="3"/>
              <signal pad="PC3" function="B" group="PWMC0_PWML" index="3"/>
              <signal pad="PC15" function="B" group="PWMC0_PWML" index="3"/>
              <signal pad="PC22" function="B" group="PWMC0_PWML" index="3"/>
              <signal pad="PD27" function="A" group="PWMC0_PWML" index="3"/>
            </signals>
          </instance>
          <instance name="PWM1">
            <register-group address-space="base" name="PWM1" name-in-module="PWM" offset="0x4005C000"/>
            <signals>
              <signal pad="PA30" function="B" group="PWMC1_PWMEXTRG" index="0"/>
              <signal pad="PA18" function="A" group="PWMC1_PWMEXTRG" index="1"/>
              <signal pad="PA21" function="C" group="PWMC1_PWMFI" index="0"/>
              <signal pad="PA26" function="D" group="PWMC1_PWMFI" index="1"/>
              <signal pad="PA28" function="D" group="PWMC1_PWMFI" index="2"/>
              <signal pad="PA12" function="C" group="PWMC1_PWMH" index="0"/>
              <signal pad="PD1" function="B" group="PWMC1_PWMH" index="0"/>
              <signal pad="PA14" function="C" group="PWMC1_PWMH" index="1"/>
              <signal pad="PD3" function="B" group="PWMC1_PWMH" index="1"/>
              <signal pad="PA31" function="D" group="PWMC1_PWMH" index="2"/>
              <signal pad="PD5" function="B" group="PWMC1_PWMH" index="2"/>
              <signal pad="PA8" function="A" group="PWMC1_PWMH" index="3"/>
              <signal pad="PD7" function="B" group="PWMC1_PWMH" index="3"/>
              <signal pad="PA11" function="C" group="PWMC1_PWML" index="0"/>
              <signal pad="PD0" function="B" group="PWMC1_PWML" index="0"/>
              <signal pad="PA13" function="C" group="PWMC1_PWML" index="1"/>
              <signal pad="PD2" function="B" group="PWMC1_PWML" index="1"/>
              <signal pad="PA23" function="D" group="PWMC1_PWML" index="2"/>
              <signal pad="PD4" function="B" group="PWMC1_PWML" index="2"/>
              <signal pad="PA5" function="A" group="PWMC1_PWML" index="3"/>
              <signal pad="PD6" function="B" group="PWMC1_PWML" index="3"/>
            </signals>
          </instance>
        </module>
