Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70J19.xml
        <register caption="Specific Address 1 Bottom Register" name="GMAC_SAB1" offset="0x088" rw="RW" size="4">
          <bitfield caption="Specific Address 1" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 1 Top Register" name="GMAC_SAT1" offset="0x08C" rw="RW" size="4">
          <bitfield caption="Specific Address 1" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 2 Bottom Register" name="GMAC_SAB2" offset="0x090" rw="RW" size="4">
          <bitfield caption="Specific Address 2" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 2 Top Register" name="GMAC_SAT2" offset="0x094" rw="RW" size="4">
          <bitfield caption="Specific Address 2" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 3 Bottom Register" name="GMAC_SAB3" offset="0x098" rw="RW" size="4">
          <bitfield caption="Specific Address 3" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 3 Top Register" name="GMAC_SAT3" offset="0x09C" rw="RW" size="4">
          <bitfield caption="Specific Address 3" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 4 Bottom Register" name="GMAC_SAB4" offset="0x0A0" rw="RW" size="4">
          <bitfield caption="Specific Address 4" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 4 Top Register" name="GMAC_SAT4" offset="0x0A4" rw="RW" size="4">
          <bitfield caption="Specific Address 4" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Type ID Match 1 Register" name="GMAC_TIDM1" offset="0x0A8" rw="RW" size="4">
          <bitfield caption="Type ID Match 1" mask="0x0000FFFF" name="TID"/>
          <bitfield caption="Enable Copying of TID Matched Frames" mask="0x80000000" name="ENID1"/>
        </register>
        <register caption="Type ID Match 2 Register" name="GMAC_TIDM2" offset="0x0AC" rw="RW" size="4">
          <bitfield caption="Type ID Match 2" mask="0x0000FFFF" name="TID"/>
          <bitfield caption="Enable Copying of TID Matched Frames" mask="0x80000000" name="ENID2"/>
        </register>
        <register caption="Type ID Match 3 Register" name="GMAC_TIDM3" offset="0x0B0" rw="RW" size="4">
          <bitfield caption="Type ID Match 3" mask="0x0000FFFF" name="TID"/>
          <bitfield caption="Enable Copying of TID Matched Frames" mask="0x80000000" name="ENID3"/>
        </register>
        <register caption="Type ID Match 4 Register" name="GMAC_TIDM4" offset="0x0B4" rw="RW" size="4">
          <bitfield caption="Type ID Match 4" mask="0x0000FFFF" name="TID"/>
          <bitfield caption="Enable Copying of TID Matched Frames" mask="0x80000000" name="ENID4"/>
        </register>
        <register caption="Wake on LAN Register" name="GMAC_WOL" offset="0x0B8" rw="RW" size="4">
          <bitfield caption="ARP Request IP Address" mask="0x0000FFFF" name="IP"/>
          <bitfield caption="Magic Packet Event Enable" mask="0x00010000" name="MAG"/>
          <bitfield caption="ARP Request IP Address" mask="0x00020000" name="ARP"/>
          <bitfield caption="Specific Address Register 1 Event Enable" mask="0x00040000" name="SA1"/>
          <bitfield caption="Multicast Hash Event Enable" mask="0x00080000" name="MTI"/>
        </register>
        <register caption="IPG Stretch Register" name="GMAC_IPGS" offset="0x0BC" rw="RW" size="4">
          <bitfield caption="Frame Length" mask="0x0000FFFF" name="FL"/>
        </register>
        <register caption="Stacked VLAN Register" name="GMAC_SVLAN" offset="0x0C0" rw="RW" size="4">
          <bitfield caption="User Defined VLAN_TYPE Field" mask="0x0000FFFF" name="VLAN_TYPE"/>
          <bitfield caption="Enable Stacked VLAN Processing Mode" mask="0x80000000" name="ESVLAN"/>
        </register>
        <register caption="Transmit PFC Pause Register" name="GMAC_TPFCP" offset="0x0C4" rw="RW" size="4">
          <bitfield caption="Priority Enable Vector" mask="0x000000FF" name="PEV"/>
          <bitfield caption="Pause Quantum" mask="0x0000FF00" name="PQ"/>
        </register>
        <register caption="Specific Address 1 Mask Bottom Register" name="GMAC_SAMB1" offset="0x0C8" rw="RW" size="4">
          <bitfield caption="Specific Address 1 Mask" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 1 Mask Top Register" name="GMAC_SAMT1" offset="0x0CC" rw="RW" size="4">
          <bitfield caption="Specific Address 1 Mask" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="1588 Timer Nanosecond Comparison Register" name="GMAC_NSC" offset="0x0DC" rw="RW" size="4">
          <bitfield caption="1588 Timer Nanosecond Comparison Value" mask="0x003FFFFF" name="NANOSEC"/>
        </register>
        <register caption="1588 Timer Second Comparison Low Register" name="GMAC_SCL" offset="0x0E0" rw="RW" size="4">
          <bitfield caption="1588 Timer Second Comparison Value" mask="0xFFFFFFFF" name="SEC"/>
        </register>
        <register caption="1588 Timer Second Comparison High Register" name="GMAC_SCH" offset="0x0E4" rw="RW" size="4">
          <bitfield caption="1588 Timer Second Comparison Value" mask="0x0000FFFF" name="SEC"/>
        </register>
        <register caption="PTP Event Frame Transmitted Seconds High Register" name="GMAC_EFTSH" offset="0x0E8" rw="R" size="4">
          <bitfield caption="Register Update" mask="0x0000FFFF" name="RUD"/>
        </register>
        <register caption="PTP Event Frame Received Seconds High Register" name="GMAC_EFRSH" offset="0x0EC" rw="R" size="4">
          <bitfield caption="Register Update" mask="0x0000FFFF" name="RUD"/>
        </register>
        <register caption="PTP Peer Event Frame Transmitted Seconds High Register" name="GMAC_PEFTSH" offset="0x0F0" rw="R" size="4">
          <bitfield caption="Register Update" mask="0x0000FFFF" name="RUD"/>
        </register>
        <register caption="PTP Peer Event Frame Received Seconds High Register" name="GMAC_PEFRSH" offset="0x0F4" rw="R" size="4">
          <bitfield caption="Register Update" mask="0x0000FFFF" name="RUD"/>
        </register>
        <register caption="Octets Transmitted Low Register" name="GMAC_OTLO" offset="0x100" rw="R" size="4">
          <bitfield caption="Transmitted Octets" mask="0xFFFFFFFF" name="TXO"/>
        </register>
        <register caption="Octets Transmitted High Register" name="GMAC_OTHI" offset="0x104" rw="R" size="4">
          <bitfield caption="Transmitted Octets" mask="0x0000FFFF" name="TXO"/>
        </register>
