Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70J19.xml
        <register caption="Region Hash Area Start Address Register" name="ICM_HASH" offset="0x34" rw="RW" size="4">
          <bitfield caption="Hash Area Start Address" mask="0xFFFFFF80" name="HASA"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 0" name="ICM_UIHVAL0" offset="0x38" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 1" name="ICM_UIHVAL1" offset="0x3C" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 2" name="ICM_UIHVAL2" offset="0x40" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 3" name="ICM_UIHVAL3" offset="0x44" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 4" name="ICM_UIHVAL4" offset="0x48" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 5" name="ICM_UIHVAL5" offset="0x4C" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 6" name="ICM_UIHVAL6" offset="0x50" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="User Initial Hash Value 0 Register 7" name="ICM_UIHVAL7" offset="0x54" rw="W" size="4">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
      </register-group>
      <value-group caption="" name="ICM_CFG__UALGO">
        <value caption="SHA1 algorithm processed" name="SHA1" value="0x0"/>
        <value caption="SHA256 algorithm processed" name="SHA256" value="0x1"/>
        <value caption="SHA224 algorithm processed" name="SHA224" value="0x4"/>
      </value-group>
      <value-group caption="" name="ICM_UASR__URAT">
        <value caption="Unspecified structure member set to one detected when the descriptor is loaded." name="UNSPEC_STRUCT_MEMBER" value="0x0"/>
        <value caption="ICM_CFG modified during active monitoring." name="ICM_CFG_MODIFIED" value="0x1"/>
        <value caption="ICM_DSCR modified during active monitoring." name="ICM_DSCR_MODIFIED" value="0x2"/>
        <value caption="ICM_HASH modified during active monitoring" name="ICM_HASH_MODIFIED" value="0x3"/>
        <value caption="Write-only register read access" name="READ_ACCESS" value="0x4"/>
      </value-group>
    </module>
    <module caption="Image Sensor Interface" name="ISI" version="6350I">
      <register-group name="ISI">
        <register caption="ISI Configuration 1 Register" name="ISI_CFG1" offset="0x00" rw="RW" size="4">
          <bitfield caption="Horizontal Synchronization Polarity" mask="0x00000004" name="HSYNC_POL"/>
          <bitfield caption="Vertical Synchronization Polarity" mask="0x00000008" name="VSYNC_POL"/>
          <bitfield caption="Pixel Clock Polarity" mask="0x00000010" name="PIXCLK_POL"/>
          <bitfield caption="Embedded Synchronization" mask="0x00000040" name="EMB_SYNC"/>
          <bitfield caption="Embedded Synchronization Correction" mask="0x00000080" name="CRC_SYNC"/>
          <bitfield caption="Frame Rate [0..7]" mask="0x00000700" name="FRATE"/>
          <bitfield caption="Disable Codec Request" mask="0x00000800" name="DISCR"/>
          <bitfield caption="Full Mode is Allowed" mask="0x00001000" name="FULL"/>
          <bitfield caption="Threshold Mask" mask="0x00006000" name="THMASK" values="ISI_CFG1__THMASK"/>
          <bitfield caption="Start of Line Delay" mask="0x00FF0000" name="SLD"/>
          <bitfield caption="Start of Frame Delay" mask="0xFF000000" name="SFD"/>
        </register>
        <register caption="ISI Configuration 2 Register" name="ISI_CFG2" offset="0x04" rw="RW" size="4">
          <bitfield caption="Vertical Size of the Image Sensor [0..2047]" mask="0x000007FF" name="IM_VSIZE"/>
          <bitfield caption="Grayscale Pixel Format Mode" mask="0x00000800" name="GS_MODE"/>
          <bitfield caption="RGB Input Mode" mask="0x00001000" name="RGB_MODE"/>
          <bitfield caption="Grayscale Mode Format Enable" mask="0x00002000" name="GRAYSCALE"/>
          <bitfield caption="RGB Format Swap Mode" mask="0x00004000" name="RGB_SWAP"/>
          <bitfield caption="Color Space for the Image Data" mask="0x00008000" name="COL_SPACE"/>
          <bitfield caption="Horizontal Size of the Image Sensor [0..2047]" mask="0x07FF0000" name="IM_HSIZE"/>
          <bitfield caption="YCrCb Format Swap Mode" mask="0x30000000" name="YCC_SWAP" values="ISI_CFG2__YCC_SWAP"/>
          <bitfield caption="RGB Pixel Mapping Configuration" mask="0xC0000000" name="RGB_CFG" values="ISI_CFG2__RGB_CFG"/>
        </register>
        <register caption="ISI Preview Size Register" name="ISI_PSIZE" offset="0x08" rw="RW" size="4">
          <bitfield caption="Vertical Size for the Preview Path" mask="0x000003FF" name="PREV_VSIZE"/>
          <bitfield caption="Horizontal Size for the Preview Path" mask="0x03FF0000" name="PREV_HSIZE"/>
        </register>
        <register caption="ISI Preview Decimation Factor Register" name="ISI_PDECF" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Decimation Factor" mask="0x000000FF" name="DEC_FACTOR"/>
        </register>
        <register caption="ISI Color Space Conversion YCrCb To RGB Set 0 Register" name="ISI_Y2R_SET0" offset="0x10" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Matrix Coefficient C0" mask="0x000000FF" name="C0"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C1" mask="0x0000FF00" name="C1"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C2" mask="0x00FF0000" name="C2"/>
          <bitfield caption="Color Space Conversion Matrix Coefficient C3" mask="0xFF000000" name="C3"/>
        </register>
