Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70J19.xml
        <register caption="DMA Channel Status Register" name="ISI_DMA_CHSR" offset="0x40" rw="R" size="4">
          <bitfield caption="Preview DMA Channel Status" mask="0x00000001" name="P_CH_S"/>
          <bitfield caption="Code DMA Channel Status" mask="0x00000002" name="C_CH_S"/>
        </register>
        <register caption="DMA Preview Base Address Register" name="ISI_DMA_P_ADDR" offset="0x44" rw="RW" size="4">
          <bitfield caption="Preview Image Base Address" mask="0xFFFFFFFC" name="P_ADDR"/>
        </register>
        <register caption="DMA Preview Control Register" name="ISI_DMA_P_CTRL" offset="0x48" rw="RW" size="4">
          <bitfield caption="Descriptor Fetch Control Bit" mask="0x00000001" name="P_FETCH"/>
          <bitfield caption="Descriptor Writeback Control Bit" mask="0x00000002" name="P_WB"/>
          <bitfield caption="Transfer Done Flag Control" mask="0x00000004" name="P_IEN"/>
          <bitfield caption="Preview Transfer Done" mask="0x00000008" name="P_DONE"/>
        </register>
        <register caption="DMA Preview Descriptor Address Register" name="ISI_DMA_P_DSCR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Preview Descriptor Base Address" mask="0xFFFFFFFC" name="P_DSCR"/>
        </register>
        <register caption="DMA Codec Base Address Register" name="ISI_DMA_C_ADDR" offset="0x50" rw="RW" size="4">
          <bitfield caption="Codec Image Base Address" mask="0xFFFFFFFC" name="C_ADDR"/>
        </register>
        <register caption="DMA Codec Control Register" name="ISI_DMA_C_CTRL" offset="0x54" rw="RW" size="4">
          <bitfield caption="Descriptor Fetch Control Bit" mask="0x00000001" name="C_FETCH"/>
          <bitfield caption="Descriptor Writeback Control Bit" mask="0x00000002" name="C_WB"/>
          <bitfield caption="Transfer Done Flag Control" mask="0x00000004" name="C_IEN"/>
          <bitfield caption="Codec Transfer Done" mask="0x00000008" name="C_DONE"/>
        </register>
        <register caption="DMA Codec Descriptor Address Register" name="ISI_DMA_C_DSCR" offset="0x58" rw="RW" size="4">
          <bitfield caption="Codec Descriptor Base Address" mask="0xFFFFFFFC" name="C_DSCR"/>
        </register>
        <register caption="Write Protection Mode Register" name="ISI_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key Password" mask="0xFFFFFF00" name="WPKEY" values="ISI_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ISI_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="ISI_CFG1__THMASK">
        <value caption="Only 4 beats AHB burst allowed" name="BEATS_4" value="0x0"/>
        <value caption="Only 4 and 8 beats AHB burst allowed" name="BEATS_8" value="0x1"/>
        <value caption="4, 8 and 16 beats AHB burst allowed" name="BEATS_16" value="0x2"/>
      </value-group>
      <value-group caption="" name="ISI_CFG2__YCC_SWAP">
        <value caption="Byte 0 Cb(i)Byte 1 Y(i)Byte 2 Cr(i)Byte 3 Y(i+1)" name="DEFAULT" value="0x0"/>
        <value caption="Byte 0 Cr(i)Byte 1 Y(i)Byte 2 Cb(i)Byte 3 Y(i+1)" name="MODE1" value="0x1"/>
        <value caption="Byte 0 Y(i)Byte 1 Cb(i)Byte 2 Y(i+1)Byte 3 Cr(i)" name="MODE2" value="0x2"/>
        <value caption="Byte 0 Y(i)Byte 1 Cr(i)Byte 2 Y(i+1)Byte 3 Cb(i)" name="MODE3" value="0x3"/>
      </value-group>
      <value-group caption="" name="ISI_CFG2__RGB_CFG">
        <value caption="Byte 0 R/G(MSB)Byte 1 G(LSB)/BByte 2 R/G(MSB)Byte 3 G(LSB)/B" name="DEFAULT" value="0x0"/>
        <value caption="Byte 0 B/G(MSB)Byte 1 G(LSB)/RByte 2 B/G(MSB)Byte 3 G(LSB)/R" name="MODE1" value="0x1"/>
        <value caption="Byte 0 G(LSB)/RByte 1 B/G(MSB)Byte 2 G(LSB)/RByte 3 B/G(MSB)" name="MODE2" value="0x2"/>
        <value caption="Byte 0 G(LSB)/BByte 1 R/G(MSB)Byte 2 G(LSB)/BByte 3 R/G(MSB)" name="MODE3" value="0x3"/>
      </value-group>
      <value-group caption="" name="ISI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x495349"/>
      </value-group>
    </module>
    <module caption="AHB Bus Matrix" name="MATRIX" version="11282B">
      <register-group name="MATRIX">
        <register caption="Master Configuration Register 0" name="MATRIX_MCFG0" offset="0x0000" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG0__ULBT"/>
        </register>
        <register caption="Master Configuration Register 1" name="MATRIX_MCFG1" offset="0x0004" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG1__ULBT"/>
        </register>
        <register caption="Master Configuration Register 2" name="MATRIX_MCFG2" offset="0x0008" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG2__ULBT"/>
        </register>
        <register caption="Master Configuration Register 3" name="MATRIX_MCFG3" offset="0x000C" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG3__ULBT"/>
        </register>
        <register caption="Master Configuration Register 4" name="MATRIX_MCFG4" offset="0x0010" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG4__ULBT"/>
        </register>
        <register caption="Master Configuration Register 5" name="MATRIX_MCFG5" offset="0x0014" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG5__ULBT"/>
        </register>
        <register caption="Master Configuration Register 6" name="MATRIX_MCFG6" offset="0x0018" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG6__ULBT"/>
        </register>
        <register caption="Master Configuration Register 8" name="MATRIX_MCFG8" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG8__ULBT"/>
        </register>
