Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70J19.xml
        <register caption="Host Pipe IN Request Register (n = 0) 0" name="USBHS_HSTPIPINRQ0" offset="0x650" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 1" name="USBHS_HSTPIPINRQ1" offset="0x654" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 2" name="USBHS_HSTPIPINRQ2" offset="0x658" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 3" name="USBHS_HSTPIPINRQ3" offset="0x65C" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 4" name="USBHS_HSTPIPINRQ4" offset="0x660" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 5" name="USBHS_HSTPIPINRQ5" offset="0x664" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 6" name="USBHS_HSTPIPINRQ6" offset="0x668" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 7" name="USBHS_HSTPIPINRQ7" offset="0x66C" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 8" name="USBHS_HSTPIPINRQ8" offset="0x670" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 9" name="USBHS_HSTPIPINRQ9" offset="0x674" rw="RW" size="4">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe Error Register (n = 0) 0" name="USBHS_HSTPIPERR0" offset="0x680" rw="RW" size="4">
          <bitfield caption="Data Toggle Error" mask="0x00000001" name="DATATGL"/>
          <bitfield caption="Data PID Error" mask="0x00000002" name="DATAPID"/>
          <bitfield caption="Data PID Error" mask="0x00000004" name="PID"/>
          <bitfield caption="Time-Out Error" mask="0x00000008" name="TIMEOUT"/>
          <bitfield caption="CRC16 Error" mask="0x00000010" name="CRC16"/>
          <bitfield caption="Error Counter" mask="0x00000060" name="COUNTER"/>
        </register>
        <register caption="Host Pipe Error Register (n = 0) 1" name="USBHS_HSTPIPERR1" offset="0x684" rw="RW" size="4">
          <bitfield caption="Data Toggle Error" mask="0x00000001" name="DATATGL"/>
          <bitfield caption="Data PID Error" mask="0x00000002" name="DATAPID"/>
          <bitfield caption="Data PID Error" mask="0x00000004" name="PID"/>
          <bitfield caption="Time-Out Error" mask="0x00000008" name="TIMEOUT"/>
          <bitfield caption="CRC16 Error" mask="0x00000010" name="CRC16"/>
          <bitfield caption="Error Counter" mask="0x00000060" name="COUNTER"/>
        </register>
        <register caption="Host Pipe Error Register (n = 0) 2" name="USBHS_HSTPIPERR2" offset="0x688" rw="RW" size="4">
          <bitfield caption="Data Toggle Error" mask="0x00000001" name="DATATGL"/>
          <bitfield caption="Data PID Error" mask="0x00000002" name="DATAPID"/>
          <bitfield caption="Data PID Error" mask="0x00000004" name="PID"/>
          <bitfield caption="Time-Out Error" mask="0x00000008" name="TIMEOUT"/>
          <bitfield caption="CRC16 Error" mask="0x00000010" name="CRC16"/>
          <bitfield caption="Error Counter" mask="0x00000060" name="COUNTER"/>
        </register>
        <register caption="Host Pipe Error Register (n = 0) 3" name="USBHS_HSTPIPERR3" offset="0x68C" rw="RW" size="4">
          <bitfield caption="Data Toggle Error" mask="0x00000001" name="DATATGL"/>
          <bitfield caption="Data PID Error" mask="0x00000002" name="DATAPID"/>
          <bitfield caption="Data PID Error" mask="0x00000004" name="PID"/>
          <bitfield caption="Time-Out Error" mask="0x00000008" name="TIMEOUT"/>
          <bitfield caption="CRC16 Error" mask="0x00000010" name="CRC16"/>
          <bitfield caption="Error Counter" mask="0x00000060" name="COUNTER"/>
        </register>
        <register caption="Host Pipe Error Register (n = 0) 4" name="USBHS_HSTPIPERR4" offset="0x690" rw="RW" size="4">
          <bitfield caption="Data Toggle Error" mask="0x00000001" name="DATATGL"/>
          <bitfield caption="Data PID Error" mask="0x00000002" name="DATAPID"/>
          <bitfield caption="Data PID Error" mask="0x00000004" name="PID"/>
          <bitfield caption="Time-Out Error" mask="0x00000008" name="TIMEOUT"/>
          <bitfield caption="CRC16 Error" mask="0x00000010" name="CRC16"/>
          <bitfield caption="Error Counter" mask="0x00000060" name="COUNTER"/>
        </register>
